#include<stdio.h>
int main()
{
    int i,j;
    int a[1000]={};

    for(a[0]=a[1]=0,i=2;i<1000;i++)/*数组初始化，假定2~1000全为素数*/
    {
        a[i]=1;/*数组下标是被测值，元素下标为一表示该元素为素数*/
    }
    for(i=2;i<100;i++){/*从2开始筛，筛去每个素数的倍数*/
        if(a[i]){
            for(j=i*i;j<1000;j+=i)/*将每一个下标为非素数的元素赋值为零*/
            a[j]=0;
        }
    }
    for(i=2,j=0;i<1000;i++){
        if(a[i]){/*筛过后，值为1的元素对应下标为素数，输出下标*/
            printf("%4d",i);
            if(++j==8){/*每行输出8个整数*/
                j=0;
                printf("\n");
            }
        }
    }
    return 0;
}